; domain
(define (domain spanner)
(:requirements :typing :strips)
(:types
	location locatable - object
	man nut spanner - locatable
)

(:predicates
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(useable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))
(:action walk
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start)
                           (link ?start ?end))
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l)
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l)
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (useable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (useable ?s)) (tightened ?n)))
)

; problem
(define (problem prob)
 (:domain spanner)
 (:objects
     bob - man
     spanner1 spanner2 spanner3 spanner4 - spanner
     nut1 nut2 - nut
     location1 location2 - location
     shed gate - location
    )
 (:init
    (at bob shed)
    (at spanner1 location1)
    (useable spanner1)
    (at spanner4 location1)
    (useable spanner4)
    (at spanner2 location2)
    (useable spanner2)
    (at spanner3 location2)
    (useable spanner3)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (link shed location1)
    (link location2 gate)
    (link location1 location2)
)
 (:goal
  (and
   (tightened nut1)
   (tightened nut2)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 2
2. (pickup_spanner location1 spanner1 bob)
   deleted: (at spanner1 location1)
   added: (carrying bob spanner1)
   goals met: 0 of 2
3. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 2
4. (pickup_spanner location2 spanner2 bob)
   deleted: (at spanner2 location2)
   added: (carrying bob spanner2)
   goals met: 0 of 2
5. (walk location2 gate bob)
   deleted: (at bob location2)
   added: (at bob gate)
   goals met: 0 of 2
6. (tighten_nut gate spanner1 bob nut2)
   deleted: (loose nut2) (useable spanner1)
   added: (tightened nut2)
   goals met: 1 of 2
7. (tighten_nut gate spanner2 bob nut1)
   deleted: (loose nut1) (useable spanner2)
   added: (tightened nut1)
   goals met: 2 of 2
